GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.h
extern volatile T5GCONbits_t T5GCONbits __at(0x21B);
// bitfield macros
#define _T5GCON_GVAL_POSN                                   0x2
#define _T5GCON_GVAL_POSITION                               0x2
#define _T5GCON_GVAL_SIZE                                   0x1
#define _T5GCON_GVAL_LENGTH                                 0x1
#define _T5GCON_GVAL_MASK                                   0x4
#define _T5GCON_GGO_POSN                                    0x3
#define _T5GCON_GGO_POSITION                                0x3
#define _T5GCON_GGO_SIZE                                    0x1
#define _T5GCON_GGO_LENGTH                                  0x1
#define _T5GCON_GGO_MASK                                    0x8
#define _T5GCON_GSPM_POSN                                   0x4
#define _T5GCON_GSPM_POSITION                               0x4
#define _T5GCON_GSPM_SIZE                                   0x1
#define _T5GCON_GSPM_LENGTH                                 0x1
#define _T5GCON_GSPM_MASK                                   0x10
#define _T5GCON_GTM_POSN                                    0x5
#define _T5GCON_GTM_POSITION                                0x5
#define _T5GCON_GTM_SIZE                                    0x1
#define _T5GCON_GTM_LENGTH                                  0x1
#define _T5GCON_GTM_MASK                                    0x20
#define _T5GCON_GPOL_POSN                                   0x6
#define _T5GCON_GPOL_POSITION                               0x6
#define _T5GCON_GPOL_SIZE                                   0x1
#define _T5GCON_GPOL_LENGTH                                 0x1
#define _T5GCON_GPOL_MASK                                   0x40
#define _T5GCON_GE_POSN                                     0x7
#define _T5GCON_GE_POSITION                                 0x7
#define _T5GCON_GE_SIZE                                     0x1
#define _T5GCON_GE_LENGTH                                   0x1
#define _T5GCON_GE_MASK                                     0x80
#define _T5GCON_T5GVAL_POSN                                 0x2
#define _T5GCON_T5GVAL_POSITION                             0x2
#define _T5GCON_T5GVAL_SIZE                                 0x1
#define _T5GCON_T5GVAL_LENGTH                               0x1
#define _T5GCON_T5GVAL_MASK                                 0x4
#define _T5GCON_T5GGO_POSN                                  0x3
#define _T5GCON_T5GGO_POSITION                              0x3
#define _T5GCON_T5GGO_SIZE                                  0x1
#define _T5GCON_T5GGO_LENGTH                                0x1
#define _T5GCON_T5GGO_MASK                                  0x8
#define _T5GCON_T5GSPM_POSN                                 0x4
#define _T5GCON_T5GSPM_POSITION                             0x4
#define _T5GCON_T5GSPM_SIZE                                 0x1
#define _T5GCON_T5GSPM_LENGTH                               0x1
#define _T5GCON_T5GSPM_MASK                                 0x10
#define _T5GCON_T5GTM_POSN                                  0x5
#define _T5GCON_T5GTM_POSITION                              0x5
#define _T5GCON_T5GTM_SIZE                                  0x1
#define _T5GCON_T5GTM_LENGTH                                0x1
#define _T5GCON_T5GTM_MASK                                  0x20
#define _T5GCON_T5GPOL_POSN                                 0x6
#define _T5GCON_T5GPOL_POSITION                             0x6
#define _T5GCON_T5GPOL_SIZE                                 0x1
#define _T5GCON_T5GPOL_LENGTH                               0x1
#define _T5GCON_T5GPOL_MASK                                 0x40
#define _T5GCON_T5GE_POSN                                   0x7
#define _T5GCON_T5GE_POSITION                               0x7
#define _T5GCON_T5GE_SIZE                                   0x1
#define _T5GCON_T5GE_LENGTH                                 0x1
#define _T5GCON_T5GE_MASK                                   0x80
#define _T5GCON_NOT_DONE_POSN                               0x3
#define _T5GCON_NOT_DONE_POSITION                           0x3
#define _T5GCON_NOT_DONE_SIZE                               0x1
#define _T5GCON_NOT_DONE_LENGTH                             0x1
#define _T5GCON_NOT_DONE_MASK                               0x8
#define _T5GCON_NOT_T5DONE_POSN                             0x3
#define _T5GCON_NOT_T5DONE_POSITION                         0x3
#define _T5GCON_NOT_T5DONE_SIZE                             0x1
#define _T5GCON_NOT_T5DONE_LENGTH                           0x1
#define _T5GCON_NOT_T5DONE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO                    :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO                  :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T5DONE             :1;
    };
} TMR5GCONbits_t;
extern volatile TMR5GCONbits_t TMR5GCONbits __at(0x21B);
// bitfield macros
#define _TMR5GCON_GVAL_POSN                                 0x2
#define _TMR5GCON_GVAL_POSITION                             0x2
#define _TMR5GCON_GVAL_SIZE                                 0x1
#define _TMR5GCON_GVAL_LENGTH                               0x1
#define _TMR5GCON_GVAL_MASK                                 0x4
#define _TMR5GCON_GGO_POSN                                  0x3
#define _TMR5GCON_GGO_POSITION                              0x3
#define _TMR5GCON_GGO_SIZE                                  0x1
#define _TMR5GCON_GGO_LENGTH                                0x1
#define _TMR5GCON_GGO_MASK                                  0x8
#define _TMR5GCON_GSPM_POSN                                 0x4
#define _TMR5GCON_GSPM_POSITION                             0x4
#define _TMR5GCON_GSPM_SIZE                                 0x1
#define _TMR5GCON_GSPM_LENGTH                               0x1
#define _TMR5GCON_GSPM_MASK                                 0x10
#define _TMR5GCON_GTM_POSN                                  0x5
#define _TMR5GCON_GTM_POSITION                              0x5
#define _TMR5GCON_GTM_SIZE                                  0x1
#define _TMR5GCON_GTM_LENGTH                                0x1
#define _TMR5GCON_GTM_MASK                                  0x20
#define _TMR5GCON_GPOL_POSN                                 0x6
#define _TMR5GCON_GPOL_POSITION                             0x6
#define _TMR5GCON_GPOL_SIZE                                 0x1
#define _TMR5GCON_GPOL_LENGTH                               0x1
#define _TMR5GCON_GPOL_MASK                                 0x40
#define _TMR5GCON_GE_POSN                                   0x7
#define _TMR5GCON_GE_POSITION                               0x7
#define _TMR5GCON_GE_SIZE                                   0x1
#define _TMR5GCON_GE_LENGTH                                 0x1
#define _TMR5GCON_GE_MASK                                   0x80
#define _TMR5GCON_T5GVAL_POSN                               0x2
#define _TMR5GCON_T5GVAL_POSITION                           0x2
#define _TMR5GCON_T5GVAL_SIZE                               0x1
#define _TMR5GCON_T5GVAL_LENGTH                             0x1
#define _TMR5GCON_T5GVAL_MASK                               0x4
#define _TMR5GCON_T5GGO_POSN                                0x3
#define _TMR5GCON_T5GGO_POSITION                            0x3
#define _TMR5GCON_T5GGO_SIZE                                0x1
#define _TMR5GCON_T5GGO_LENGTH                              0x1
#define _TMR5GCON_T5GGO_MASK                                0x8
#define _TMR5GCON_T5GSPM_POSN                               0x4
#define _TMR5GCON_T5GSPM_POSITION                           0x4
#define _TMR5GCON_T5GSPM_SIZE                               0x1
#define _TMR5GCON_T5GSPM_LENGTH                             0x1
#define _TMR5GCON_T5GSPM_MASK                               0x10
#define _TMR5GCON_T5GTM_POSN                                0x5
#define _TMR5GCON_T5GTM_POSITION                            0x5
#define _TMR5GCON_T5GTM_SIZE                                0x1
#define _TMR5GCON_T5GTM_LENGTH                              0x1
#define _TMR5GCON_T5GTM_MASK                                0x20
#define _TMR5GCON_T5GPOL_POSN                               0x6
#define _TMR5GCON_T5GPOL_POSITION                           0x6
#define _TMR5GCON_T5GPOL_SIZE                               0x1
#define _TMR5GCON_T5GPOL_LENGTH                             0x1
#define _TMR5GCON_T5GPOL_MASK                               0x40
#define _TMR5GCON_T5GE_POSN                                 0x7
#define _TMR5GCON_T5GE_POSITION                             0x7
#define _TMR5GCON_T5GE_SIZE                                 0x1
#define _TMR5GCON_T5GE_LENGTH                               0x1
#define _TMR5GCON_T5GE_MASK                                 0x80
#define _TMR5GCON_NOT_DONE_POSN                             0x3
#define _TMR5GCON_NOT_DONE_POSITION                         0x3
#define _TMR5GCON_NOT_DONE_SIZE                             0x1
#define _TMR5GCON_NOT_DONE_LENGTH                           0x1
#define _TMR5GCON_NOT_DONE_MASK                             0x8
#define _TMR5GCON_NOT_T5DONE_POSN                           0x3
#define _TMR5GCON_NOT_T5DONE_POSITION                       0x3
#define _TMR5GCON_NOT_T5DONE_SIZE                           0x1
#define _TMR5GCON_NOT_T5DONE_LENGTH                         0x1
#define _TMR5GCON_NOT_T5DONE_MASK                           0x8

// Register: T5GATE
#define T5GATE T5GATE
extern volatile unsigned char           T5GATE              __at(0x21C);
#ifndef _LIB_BUILD
asm("T5GATE equ 021Ch");
#endif
// aliases
extern volatile unsigned char           TMR5GATE            __at(0x21C);
#ifndef _LIB_BUILD
asm("TMR5GATE equ 021Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :8;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
        unsigned T5GSS2                 :1;
        unsigned T5GSS3                 :1;
        unsigned T5GSS4                 :1;
    };
} T5GATEbits_t;
