GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.h
extern volatile CWG2CLKCONbits_t CWG2CLKCONbits __at(0x616);
// bitfield macros
#define _CWG2CLKCON_CLK_POSN                                0x0
#define _CWG2CLKCON_CLK_POSITION                            0x0
#define _CWG2CLKCON_CLK_SIZE                                0x1
#define _CWG2CLKCON_CLK_LENGTH                              0x1
#define _CWG2CLKCON_CLK_MASK                                0x1
#define _CWG2CLKCON_CWG2CS_POSN                             0x0
#define _CWG2CLKCON_CWG2CS_POSITION                         0x0
#define _CWG2CLKCON_CWG2CS_SIZE                             0x1
#define _CWG2CLKCON_CWG2CS_LENGTH                           0x1
#define _CWG2CLKCON_CWG2CS_MASK                             0x1

// Register: CWG2ISM
#define CWG2ISM CWG2ISM
extern volatile unsigned char           CWG2ISM             __at(0x617);
#ifndef _LIB_BUILD
asm("CWG2ISM equ 0617h");
#endif
// aliases
extern volatile unsigned char           CWG2DAT             __at(0x617);
#ifndef _LIB_BUILD
asm("CWG2DAT equ 0617h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :4;
    };
    struct {
        unsigned CWG2DAT0               :1;
        unsigned CWG2DAT1               :1;
        unsigned CWG2DAT2               :1;
        unsigned CWG2DAT3               :1;
    };
} CWG2ISMbits_t;
extern volatile CWG2ISMbits_t CWG2ISMbits __at(0x617);
// bitfield macros
#define _CWG2ISM_DAT_POSN                                   0x0
#define _CWG2ISM_DAT_POSITION                               0x0
#define _CWG2ISM_DAT_SIZE                                   0x4
#define _CWG2ISM_DAT_LENGTH                                 0x4
#define _CWG2ISM_DAT_MASK                                   0xF
#define _CWG2ISM_CWG2DAT0_POSN                              0x0
#define _CWG2ISM_CWG2DAT0_POSITION                          0x0
#define _CWG2ISM_CWG2DAT0_SIZE                              0x1
#define _CWG2ISM_CWG2DAT0_LENGTH                            0x1
#define _CWG2ISM_CWG2DAT0_MASK                              0x1
#define _CWG2ISM_CWG2DAT1_POSN                              0x1
#define _CWG2ISM_CWG2DAT1_POSITION                          0x1
#define _CWG2ISM_CWG2DAT1_SIZE                              0x1
#define _CWG2ISM_CWG2DAT1_LENGTH                            0x1
#define _CWG2ISM_CWG2DAT1_MASK                              0x2
#define _CWG2ISM_CWG2DAT2_POSN                              0x2
#define _CWG2ISM_CWG2DAT2_POSITION                          0x2
#define _CWG2ISM_CWG2DAT2_SIZE                              0x1
#define _CWG2ISM_CWG2DAT2_LENGTH                            0x1
#define _CWG2ISM_CWG2DAT2_MASK                              0x4
#define _CWG2ISM_CWG2DAT3_POSN                              0x3
#define _CWG2ISM_CWG2DAT3_POSITION                          0x3
#define _CWG2ISM_CWG2DAT3_SIZE                              0x1
#define _CWG2ISM_CWG2DAT3_LENGTH                            0x1
#define _CWG2ISM_CWG2DAT3_MASK                              0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :4;
    };
    struct {
        unsigned CWG2DAT0               :1;
        unsigned CWG2DAT1               :1;
        unsigned CWG2DAT2               :1;
        unsigned CWG2DAT3               :1;
    };
} CWG2DATbits_t;
extern volatile CWG2DATbits_t CWG2DATbits __at(0x617);
// bitfield macros
#define _CWG2DAT_DAT_POSN                                   0x0
#define _CWG2DAT_DAT_POSITION                               0x0
#define _CWG2DAT_DAT_SIZE                                   0x4
#define _CWG2DAT_DAT_LENGTH                                 0x4
#define _CWG2DAT_DAT_MASK                                   0xF
#define _CWG2DAT_CWG2DAT0_POSN                              0x0
#define _CWG2DAT_CWG2DAT0_POSITION                          0x0
#define _CWG2DAT_CWG2DAT0_SIZE                              0x1
#define _CWG2DAT_CWG2DAT0_LENGTH                            0x1
#define _CWG2DAT_CWG2DAT0_MASK                              0x1
#define _CWG2DAT_CWG2DAT1_POSN                              0x1
#define _CWG2DAT_CWG2DAT1_POSITION                          0x1
#define _CWG2DAT_CWG2DAT1_SIZE                              0x1
#define _CWG2DAT_CWG2DAT1_LENGTH                            0x1
#define _CWG2DAT_CWG2DAT1_MASK                              0x2
#define _CWG2DAT_CWG2DAT2_POSN                              0x2
#define _CWG2DAT_CWG2DAT2_POSITION                          0x2
#define _CWG2DAT_CWG2DAT2_SIZE                              0x1
#define _CWG2DAT_CWG2DAT2_LENGTH                            0x1
#define _CWG2DAT_CWG2DAT2_MASK                              0x4
#define _CWG2DAT_CWG2DAT3_POSN                              0x3
#define _CWG2DAT_CWG2DAT3_POSITION                          0x3
#define _CWG2DAT_CWG2DAT3_SIZE                              0x1
#define _CWG2DAT_CWG2DAT3_LENGTH                            0x1
#define _CWG2DAT_CWG2DAT3_MASK                              0x8

// Register: CWG2DBR
#define CWG2DBR CWG2DBR
extern volatile unsigned char           CWG2DBR             __at(0x618);
#ifndef _LIB_BUILD
asm("CWG2DBR equ 0618h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG2DBR                :6;
    };
    struct {
        unsigned CWG2DBR0               :1;
        unsigned CWG2DBR1               :1;
        unsigned CWG2DBR2               :1;
        unsigned CWG2DBR3               :1;
        unsigned CWG2DBR4               :1;
        unsigned CWG2DBR5               :1;
    };
} CWG2DBRbits_t;
extern volatile CWG2DBRbits_t CWG2DBRbits __at(0x618);
// bitfield macros
#define _CWG2DBR_DBR_POSN                                   0x0
#define _CWG2DBR_DBR_POSITION                               0x0
#define _CWG2DBR_DBR_SIZE                                   0x6
#define _CWG2DBR_DBR_LENGTH                                 0x6
#define _CWG2DBR_DBR_MASK                                   0x3F
#define _CWG2DBR_DBR0_POSN                                  0x0
#define _CWG2DBR_DBR0_POSITION                              0x0
#define _CWG2DBR_DBR0_SIZE                                  0x1
#define _CWG2DBR_DBR0_LENGTH                                0x1
#define _CWG2DBR_DBR0_MASK                                  0x1
#define _CWG2DBR_DBR1_POSN                                  0x1
#define _CWG2DBR_DBR1_POSITION                              0x1
#define _CWG2DBR_DBR1_SIZE                                  0x1
#define _CWG2DBR_DBR1_LENGTH                                0x1
#define _CWG2DBR_DBR1_MASK                                  0x2
#define _CWG2DBR_DBR2_POSN                                  0x2
#define _CWG2DBR_DBR2_POSITION                              0x2
#define _CWG2DBR_DBR2_SIZE                                  0x1
#define _CWG2DBR_DBR2_LENGTH                                0x1
#define _CWG2DBR_DBR2_MASK                                  0x4
#define _CWG2DBR_DBR3_POSN                                  0x3
#define _CWG2DBR_DBR3_POSITION                              0x3
#define _CWG2DBR_DBR3_SIZE                                  0x1
#define _CWG2DBR_DBR3_LENGTH                                0x1
#define _CWG2DBR_DBR3_MASK                                  0x8
#define _CWG2DBR_DBR4_POSN                                  0x4
#define _CWG2DBR_DBR4_POSITION                              0x4
#define _CWG2DBR_DBR4_SIZE                                  0x1
#define _CWG2DBR_DBR4_LENGTH                                0x1
#define _CWG2DBR_DBR4_MASK                                  0x10
#define _CWG2DBR_DBR5_POSN                                  0x5
#define _CWG2DBR_DBR5_POSITION                              0x5
#define _CWG2DBR_DBR5_SIZE                                  0x1
#define _CWG2DBR_DBR5_LENGTH                                0x1
#define _CWG2DBR_DBR5_MASK                                  0x20
#define _CWG2DBR_CWG2DBR_POSN                               0x0
#define _CWG2DBR_CWG2DBR_POSITION                           0x0
#define _CWG2DBR_CWG2DBR_SIZE                               0x6
#define _CWG2DBR_CWG2DBR_LENGTH                             0x6
#define _CWG2DBR_CWG2DBR_MASK                               0x3F
#define _CWG2DBR_CWG2DBR0_POSN                              0x0
#define _CWG2DBR_CWG2DBR0_POSITION                          0x0
#define _CWG2DBR_CWG2DBR0_SIZE                              0x1
#define _CWG2DBR_CWG2DBR0_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR0_MASK                              0x1
#define _CWG2DBR_CWG2DBR1_POSN                              0x1
#define _CWG2DBR_CWG2DBR1_POSITION                          0x1
#define _CWG2DBR_CWG2DBR1_SIZE                              0x1
#define _CWG2DBR_CWG2DBR1_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR1_MASK                              0x2
#define _CWG2DBR_CWG2DBR2_POSN                              0x2
#define _CWG2DBR_CWG2DBR2_POSITION                          0x2
#define _CWG2DBR_CWG2DBR2_SIZE                              0x1
#define _CWG2DBR_CWG2DBR2_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR2_MASK                              0x4
#define _CWG2DBR_CWG2DBR3_POSN                              0x3
#define _CWG2DBR_CWG2DBR3_POSITION                          0x3
#define _CWG2DBR_CWG2DBR3_SIZE                              0x1
#define _CWG2DBR_CWG2DBR3_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR3_MASK                              0x8
#define _CWG2DBR_CWG2DBR4_POSN                              0x4
#define _CWG2DBR_CWG2DBR4_POSITION                          0x4
#define _CWG2DBR_CWG2DBR4_SIZE                              0x1
#define _CWG2DBR_CWG2DBR4_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR4_MASK                              0x10
#define _CWG2DBR_CWG2DBR5_POSN                              0x5
#define _CWG2DBR_CWG2DBR5_POSITION                          0x5
#define _CWG2DBR_CWG2DBR5_SIZE                              0x1
#define _CWG2DBR_CWG2DBR5_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR5_MASK                              0x20

