GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.h
// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x796);
#ifndef _LIB_BUILD
asm("PMD0 equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned NVMMD                  :1;
        unsigned                        :3;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x796);
// bitfield macros
#define _PMD0_IOCMD_POSN                                    0x0
#define _PMD0_IOCMD_POSITION                                0x0
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x1
#define _PMD0_CLKRMD_POSN                                   0x1
#define _PMD0_CLKRMD_POSITION                               0x1
#define _PMD0_CLKRMD_SIZE                                   0x1
#define _PMD0_CLKRMD_LENGTH                                 0x1
#define _PMD0_CLKRMD_MASK                                   0x2
#define _PMD0_NVMMD_POSN                                    0x2
#define _PMD0_NVMMD_POSITION                                0x2
#define _PMD0_NVMMD_SIZE                                    0x1
#define _PMD0_NVMMD_LENGTH                                  0x1
#define _PMD0_NVMMD_MASK                                    0x4
#define _PMD0_FVRMD_POSN                                    0x6
#define _PMD0_FVRMD_POSITION                                0x6
#define _PMD0_FVRMD_SIZE                                    0x1
#define _PMD0_FVRMD_LENGTH                                  0x1
#define _PMD0_FVRMD_MASK                                    0x40
#define _PMD0_SYSCMD_POSN                                   0x7
#define _PMD0_SYSCMD_POSITION                               0x7
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x797);
#ifndef _LIB_BUILD
asm("PMD1 equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x797);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_TMR5MD_POSN                                   0x5
#define _PMD1_TMR5MD_POSITION                               0x5
#define _PMD1_TMR5MD_SIZE                                   0x1
#define _PMD1_TMR5MD_LENGTH                                 0x1
#define _PMD1_TMR5MD_MASK                                   0x20
#define _PMD1_TMR6MD_POSN                                   0x6
#define _PMD1_TMR6MD_POSITION                               0x6
#define _PMD1_TMR6MD_SIZE                                   0x1
#define _PMD1_TMR6MD_LENGTH                                 0x1
#define _PMD1_TMR6MD_MASK                                   0x40

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x798);
#ifndef _LIB_BUILD
asm("PMD2 equ 0798h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned NCO1MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x798);
// bitfield macros
#define _PMD2_NCO1MD_POSN                                   0x7
#define _PMD2_NCO1MD_POSITION                               0x7
#define _PMD2_NCO1MD_SIZE                                   0x1
#define _PMD2_NCO1MD_LENGTH                                 0x1
#define _PMD2_NCO1MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x799);
#ifndef _LIB_BUILD
asm("PMD3 equ 0799h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned                        :2;
        unsigned ADCMD                  :1;
        unsigned DAC1MD                 :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x799);
// bitfield macros
#define _PMD3_ZCDMD_POSN                                    0x0
#define _PMD3_ZCDMD_POSITION                                0x0
#define _PMD3_ZCDMD_SIZE                                    0x1
#define _PMD3_ZCDMD_LENGTH                                  0x1
#define _PMD3_ZCDMD_MASK                                    0x1
#define _PMD3_CMP1MD_POSN                                   0x1
#define _PMD3_CMP1MD_POSITION                               0x1
#define _PMD3_CMP1MD_SIZE                                   0x1
#define _PMD3_CMP1MD_LENGTH                                 0x1
#define _PMD3_CMP1MD_MASK                                   0x2
#define _PMD3_CMP2MD_POSN                                   0x2
#define _PMD3_CMP2MD_POSITION                               0x2
#define _PMD3_CMP2MD_SIZE                                   0x1
#define _PMD3_CMP2MD_LENGTH                                 0x1
#define _PMD3_CMP2MD_MASK                                   0x4
#define _PMD3_ADCMD_POSN                                    0x5
#define _PMD3_ADCMD_POSITION                                0x5
#define _PMD3_ADCMD_SIZE                                    0x1
#define _PMD3_ADCMD_LENGTH                                  0x1
#define _PMD3_ADCMD_MASK                                    0x20
#define _PMD3_DAC1MD_POSN                                   0x6
#define _PMD3_DAC1MD_POSITION                               0x6
#define _PMD3_DAC1MD_SIZE                                   0x1
#define _PMD3_DAC1MD_LENGTH                                 0x1
#define _PMD3_DAC1MD_MASK                                   0x40

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x79A);
#ifndef _LIB_BUILD
asm("PMD4 equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned PWM6MD                 :1;
        unsigned PWM7MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x79A);
// bitfield macros
#define _PMD4_CCP1MD_POSN                                   0x0
#define _PMD4_CCP1MD_POSITION                               0x0
#define _PMD4_CCP1MD_SIZE                                   0x1
#define _PMD4_CCP1MD_LENGTH                                 0x1
#define _PMD4_CCP1MD_MASK                                   0x1
#define _PMD4_CCP2MD_POSN                                   0x1
#define _PMD4_CCP2MD_POSITION                               0x1
#define _PMD4_CCP2MD_SIZE                                   0x1
#define _PMD4_CCP2MD_LENGTH                                 0x1
#define _PMD4_CCP2MD_MASK                                   0x2
#define _PMD4_CCP3MD_POSN                                   0x2
#define _PMD4_CCP3MD_POSITION                               0x2
#define _PMD4_CCP3MD_SIZE                                   0x1
#define _PMD4_CCP3MD_LENGTH                                 0x1
#define _PMD4_CCP3MD_MASK                                   0x4
#define _PMD4_CCP4MD_POSN                                   0x3
#define _PMD4_CCP4MD_POSITION                               0x3
#define _PMD4_CCP4MD_SIZE                                   0x1
#define _PMD4_CCP4MD_LENGTH                                 0x1
#define _PMD4_CCP4MD_MASK                                   0x8
#define _PMD4_CCP5MD_POSN                                   0x4
#define _PMD4_CCP5MD_POSITION                               0x4
#define _PMD4_CCP5MD_SIZE                                   0x1
#define _PMD4_CCP5MD_LENGTH                                 0x1
#define _PMD4_CCP5MD_MASK                                   0x10
#define _PMD4_PWM6MD_POSN                                   0x5
#define _PMD4_PWM6MD_POSITION                               0x5
#define _PMD4_PWM6MD_SIZE                                   0x1
#define _PMD4_PWM6MD_LENGTH                                 0x1
#define _PMD4_PWM6MD_MASK                                   0x20
#define _PMD4_PWM7MD_POSN                                   0x6
#define _PMD4_PWM7MD_POSITION                               0x6
#define _PMD4_PWM7MD_SIZE                                   0x1
#define _PMD4_PWM7MD_LENGTH                                 0x1
#define _PMD4_PWM7MD_MASK                                   0x40

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x79B);
#ifndef _LIB_BUILD
asm("PMD5 equ 079Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CWG1MD                 :1;
        unsigned CWG2MD                 :1;
        unsigned CWG3MD                 :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x79B);
// bitfield macros
#define _PMD5_CWG1MD_POSN                                   0x5
#define _PMD5_CWG1MD_POSITION                               0x5
#define _PMD5_CWG1MD_SIZE                                   0x1
#define _PMD5_CWG1MD_LENGTH                                 0x1
#define _PMD5_CWG1MD_MASK                                   0x20
#define _PMD5_CWG2MD_POSN                                   0x6
#define _PMD5_CWG2MD_POSITION                               0x6
#define _PMD5_CWG2MD_SIZE                                   0x1
#define _PMD5_CWG2MD_LENGTH                                 0x1
#define _PMD5_CWG2MD_MASK                                   0x40
#define _PMD5_CWG3MD_POSN                                   0x7
#define _PMD5_CWG3MD_POSITION                               0x7
#define _PMD5_CWG3MD_SIZE                                   0x1
#define _PMD5_CWG3MD_LENGTH                                 0x1
#define _PMD5_CWG3MD_MASK                                   0x80

// Register: PMD6
#define PMD6 PMD6
extern volatile unsigned char           PMD6                __at(0x79C);
#ifndef _LIB_BUILD
asm("PMD6 equ 079Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MSSP1MD                :1;
        unsigned MSSP2MD                :1;
        unsigned                        :2;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
    };
} PMD6bits_t;
extern volatile PMD6bits_t PMD6bits __at(0x79C);
// bitfield macros
#define _PMD6_MSSP1MD_POSN                                  0x0
#define _PMD6_MSSP1MD_POSITION                              0x0
#define _PMD6_MSSP1MD_SIZE                                  0x1
#define _PMD6_MSSP1MD_LENGTH                                0x1
#define _PMD6_MSSP1MD_MASK                                  0x1
#define _PMD6_MSSP2MD_POSN                                  0x1
#define _PMD6_MSSP2MD_POSITION                              0x1
#define _PMD6_MSSP2MD_SIZE                                  0x1
#define _PMD6_MSSP2MD_LENGTH                                0x1
#define _PMD6_MSSP2MD_MASK                                  0x2
#define _PMD6_U1MD_POSN                                     0x4
#define _PMD6_U1MD_POSITION                                 0x4
#define _PMD6_U1MD_SIZE                                     0x1
#define _PMD6_U1MD_LENGTH                                   0x1
#define _PMD6_U1MD_MASK                                     0x10
#define _PMD6_U2MD_POSN                                     0x5
#define _PMD6_U2MD_POSITION                                 0x5
#define _PMD6_U2MD_SIZE                                     0x1
#define _PMD6_U2MD_LENGTH                                   0x1
#define _PMD6_U2MD_MASK                                     0x20

// Register: PMD7
#define PMD7 PMD7
extern volatile unsigned char           PMD7                __at(0x79D);
#ifndef _LIB_BUILD
asm("PMD7 equ 079Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSM1MD                 :1;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned SMT1MD                 :1;
        unsigned SMU2MD                 :1;
    };
} PMD7bits_t;
extern volatile PMD7bits_t PMD7bits __at(0x79D);
// bitfield macros
#define _PMD7_DSM1MD_POSN                                   0x0
#define _PMD7_DSM1MD_POSITION                               0x0
#define _PMD7_DSM1MD_SIZE                                   0x1
#define _PMD7_DSM1MD_LENGTH                                 0x1
#define _PMD7_DSM1MD_MASK                                   0x1
#define _PMD7_CLC1MD_POSN                                   0x1
#define _PMD7_CLC1MD_POSITION                               0x1
#define _PMD7_CLC1MD_SIZE                                   0x1
#define _PMD7_CLC1MD_LENGTH                                 0x1
#define _PMD7_CLC1MD_MASK                                   0x2
#define _PMD7_CLC2MD_POSN                                   0x2
#define _PMD7_CLC2MD_POSITION                               0x2
#define _PMD7_CLC2MD_SIZE                                   0x1
#define _PMD7_CLC2MD_LENGTH                                 0x1
#define _PMD7_CLC2MD_MASK                                   0x4
#define _PMD7_CLC3MD_POSN                                   0x3
#define _PMD7_CLC3MD_POSITION                               0x3
#define _PMD7_CLC3MD_SIZE                                   0x1
#define _PMD7_CLC3MD_LENGTH                                 0x1
#define _PMD7_CLC3MD_MASK                                   0x8
#define _PMD7_CLC4MD_POSN                                   0x4
#define _PMD7_CLC4MD_POSITION                               0x4
#define _PMD7_CLC4MD_SIZE                                   0x1
#define _PMD7_CLC4MD_LENGTH                                 0x1
#define _PMD7_CLC4MD_MASK                                   0x10
#define _PMD7_SMT1MD_POSN                                   0x5
#define _PMD7_SMT1MD_POSITION                               0x5
#define _PMD7_SMT1MD_SIZE                                   0x1
#define _PMD7_SMT1MD_LENGTH                                 0x1
#define _PMD7_SMT1MD_MASK                                   0x20
#define _PMD7_SMU2MD_POSN                                   0x6
#define _PMD7_SMU2MD_POSITION                               0x6
#define _PMD7_SMU2MD_SIZE                                   0x1
#define _PMD7_SMU2MD_LENGTH                                 0x1
#define _PMD7_SMU2MD_MASK                                   0x40

// Register: WDTCON0
#define WDTCON0 WDTCON0
extern volatile unsigned char           WDTCON0             __at(0x80C);
#ifndef _LIB_BUILD
asm("WDTCON0 equ 080Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned WDTPS                  :5;
    };
    struct {
        unsigned SWDTEN                 :1;
    };
    struct {
        unsigned WDTSEN                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
    };
} WDTCON0bits_t;
extern volatile WDTCON0bits_t WDTCON0bits __at(0x80C);
// bitfield macros
#define _WDTCON0_SEN_POSN                                   0x0
#define _WDTCON0_SEN_POSITION                               0x0
#define _WDTCON0_SEN_SIZE                                   0x1
#define _WDTCON0_SEN_LENGTH                                 0x1
#define _WDTCON0_SEN_MASK                                   0x1
#define _WDTCON0_WDTPS_POSN                                 0x1
#define _WDTCON0_WDTPS_POSITION                             0x1
#define _WDTCON0_WDTPS_SIZE                                 0x5
#define _WDTCON0_WDTPS_LENGTH                               0x5
#define _WDTCON0_WDTPS_MASK                                 0x3E
#define _WDTCON0_SWDTEN_POSN                                0x0
#define _WDTCON0_SWDTEN_POSITION                            0x0
#define _WDTCON0_SWDTEN_SIZE                                0x1
#define _WDTCON0_SWDTEN_LENGTH                              0x1
#define _WDTCON0_SWDTEN_MASK                                0x1
#define _WDTCON0_WDTSEN_POSN                                0x0
#define _WDTCON0_WDTSEN_POSITION                            0x0
#define _WDTCON0_WDTSEN_SIZE                                0x1
#define _WDTCON0_WDTSEN_LENGTH                              0x1
#define _WDTCON0_WDTSEN_MASK                                0x1
#define _WDTCON0_WDTPS0_POSN                                0x1
#define _WDTCON0_WDTPS0_POSITION                            0x1
#define _WDTCON0_WDTPS0_SIZE                                0x1
#define _WDTCON0_WDTPS0_LENGTH                              0x1
#define _WDTCON0_WDTPS0_MASK                                0x2
#define _WDTCON0_WDTPS1_POSN                                0x2
#define _WDTCON0_WDTPS1_POSITION                            0x2
#define _WDTCON0_WDTPS1_SIZE                                0x1
#define _WDTCON0_WDTPS1_LENGTH                              0x1
#define _WDTCON0_WDTPS1_MASK                                0x4
#define _WDTCON0_WDTPS2_POSN                                0x3
#define _WDTCON0_WDTPS2_POSITION                            0x3
#define _WDTCON0_WDTPS2_SIZE                                0x1
#define _WDTCON0_WDTPS2_LENGTH                              0x1
#define _WDTCON0_WDTPS2_MASK                                0x8
#define _WDTCON0_WDTPS3_POSN                                0x4
#define _WDTCON0_WDTPS3_POSITION                            0x4
#define _WDTCON0_WDTPS3_SIZE                                0x1
#define _WDTCON0_WDTPS3_LENGTH                              0x1
#define _WDTCON0_WDTPS3_MASK                                0x10
#define _WDTCON0_WDTPS4_POSN                                0x5
#define _WDTCON0_WDTPS4_POSITION                            0x5
#define _WDTCON0_WDTPS4_SIZE                                0x1
#define _WDTCON0_WDTPS4_LENGTH                              0x1
#define _WDTCON0_WDTPS4_MASK                                0x20

// Register: WDTCON1
#define WDTCON1 WDTCON1
extern volatile unsigned char           WDTCON1             __at(0x80D);
#ifndef _LIB_BUILD
asm("WDTCON1 equ 080Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WINDOW                 :3;
        unsigned                        :1;
        unsigned WDTCS                  :3;
    };
    struct {
        unsigned WINDOW0                :1;
        unsigned WINDOW1                :1;
        unsigned WINDOW2                :1;
    };
    struct {
        unsigned WDTWINDOW              :3;
    };
    struct {
        unsigned WDTWINDOW0             :1;
        unsigned WDTWINDOW1             :1;
        unsigned WDTWINDOW2             :1;
        unsigned                        :1;
        unsigned WDTCS0                 :1;
        unsigned WDTCS1                 :1;
        unsigned WDTCS2                 :1;
    };
} WDTCON1bits_t;
